Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ། དབང་པོའི་མགོ་འདུལ་བར་གསོལ་ཞེས་བྱས་སོ། །
en: Blessed One, out of compassion, please tame Head of Indra.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to the people of Rājagṛha by his silence.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་དོང་ངོ་། །
en: Understanding that by his silence the Blessed One had given his assent, the inhabitants of Rājagṛha then took leave of the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: The Blessed One disappeared from Rājagṛha and

source: ཡངས་པ་ཅན་དུ་གཤེགས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་ཕྱིན་ཅད་དབང་པོའི་མགོ་འཕོང་མི་ཤེས་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་ནས།
en: traveled to Vaiśālī, where he performed a miracle so that Head of Indra simply did not know archery anymore.

source: དེ་རྨོངས་པར་གྱུར་ཏེ། ཅིའི་ཕྱིར་བདག་འདི་ཁོ་ན་ལྟར་མ་རུང་བར་གྱུར་སྙམ་མོ། །
en: This confused him, and he thought, “What’s wrong with me?”

source: དེ་ནས་དེས་ཅི་ལྟར་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་བཞུགས་པ་ལས། དགྱེས་བཞིན་དུ་ཡངས་པ་ཅན་དུ་གཤེགས་པ་ཐོས་ནས།
en: Then he heard that the Blessed One, who had been living in Rājagṛha, had come to Vaiśālī,

source: དེས་བསམས་པ་བཅོམ་ལྡན་འདས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་ཡིན་པས་ན། ཅིའི་ཕྱིར་བདག་འཕོང་གི་རིག་པ་མི་ཤེས་པར་གྱུར་པ་ཐུགས་སུ་ཆུད་དོ་སྙམ་ནས།
en: and he thought, “Since the Blessed One is omniscient and all-seeing, he will be able to directly apprehend why I do not know archery anymore.”

source: དེས་ན་དབང་པོའི་མགོས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When he heard it, Head of Indra destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: After he saw the truths, he rose from his seat, drew down the right shoulder of his upper garment,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: and requested, “Blessed One, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དབང་པོའི་མགོ་རེ་ཞིག་སློབ་མ་རྣམས་ལ་སྦྲོན་ཅིག་དང་།
en: “Head of Indra,” the Blessed One told him, “go announce this to your students.

source: དེའི་འོག་ཏུ་ཁྱོད་རབ་ཏུ་བྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོར་བྱ་བ་ནི་སླའོ། །
en: After that it will be easy for you to go forth, complete your novitiate, and achieve full ordination.”

source: དེས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: “As you wish, Blessed One,” he replied.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་སྟེ། དེ་ཡངས་པ་ཅན་དུ་སོང་ནས།
en: He took leave of the Blessed One and went to Vaiśālī,

source: ལིཙྪ་བཱི་ལྔ་བརྒྱ་པོ་རྣམས་ཅི་ནས་དེ་དག་ཐམས་ཅད་རབ་ཏུ་འབྱུང་བར་འདོད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ཏོ། །
en: where he taught the five hundred Licchavis the Dharma in such a way that they too wished to go forth no matter what.

source: དེ་ནས་དེ་རྣམས་ཀྱིས་ཕ་མ་ལ་གསོལ་ཏེ།
en: They then asked for their parents’ permission and

source: དབང་པོའི་མགོ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: went with Head of Indra to see the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེས་ན་ལིཙྪ་བཱི་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: After they saw the truths, they rose from their seats, drew down the right shoulder of their upper garments,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ།
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices,

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་དབང་པོའི་མགོ་ལ་བརྟེན་ནས། ལིཙྪ་བཱི་ལྔ་བརྒྱ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: “Lord,” the monks inquired of the Blessed Buddha, “tell us why the five hundred Licchavis entrusted themselves to Head of Indra, went forth in the doctrine of the Blessed One,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་དབང་པོའི་མགོ་ལ་སོགས་པ་ལིཙྪ་བཱི་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ངས་སྡིག་པ་ལས་བཟློག་སྟེ། ཅི་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I turned Head of Indra and the five hundred Licchavis away from sinful actions and set them on the path of the ten virtuous actions.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་གྲུ་འཛིན་ཅེས་བྱ་བ་ན། རྒྱལ་པོ་དབང་ཆེན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དོ། །
en: “Monks, in times gone by, King Mahendra reigned in the city of Potalaka.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་དེའི་བཙུན་མོ་ལ་བུ་ཆགས་ནས།
en: One day the royal queen conceived,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ། མདོག་བཟང་བ་གསེར་གྱི་མདོག་ཅན། མགོ་བོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ། དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ་སྣ་ལེགས་པ། སྨིན་མ་སྟུག་པ་ཞིག་བཙས་སོ། །
en: and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: ཁྱེའུ་འདི་དབང་ཆེན་གྱི་བུ་ཡིན་པས་ན། ཁྱེའུ་འདིའི་མིང་དབང་ཆེན་སྡེ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: ‘Since this is Mahendra’s child, his name will be Mahendrasena .’

source: དེ་ནས་ཁྱེའུ་དབང་ཆེན་སྡེ་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: “They reared young Mahendrasena on milk, yogurt, butter, ghee, and milk solids.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ། གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་ཐར་བར་བྱ་བ་དང་། ལྕགས་ཀྱུས་གཟུང་བ་དང་། ཞགས་པས་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པས་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲག་པར་ཕོག་པ་དང་། གནད་དུ་ཕོག་པ་དང་། མ་ཚོར་བར་ཕོག་པ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་བསླབས་ནས། གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: As he grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage. By the time he had been educated in all of these, he was learned in the five areas of knowledge.

source: དེ་ནས་དེས་བལྟས་ན། ཕ་དང་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཆོས་མ་ཡིན་པས་རྒྱལ་པོ་བྱས་ནས།
en: “He came to see that his father and the five hundred ministers ruled both righteously and unrighteously,

source: དེས་བསམས་པ་བདག་གིས་རྒྱལ་སྲིད་བཏང་ལ་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་འགྲོ་བར་བྱའོ་
en: and he thought, ‘I will give up the kingdom and go to live in a forest devoted to austerities.’

source: སྙམ་སྟེ། ཕ་མ་ལ་གསོལ་ནས་ནགས་འདབ་ཏུ་གནས་བཅས་སོ། །
en: Reflecting in this way, he asked for his parents’ permission and went to live in the forest.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཕ་ཤིའོ། །
en: “One day his father died.

source: དེ་ཤི་ནས་ཉི་འོག་གི་རྒྱལ་པོ་དག་གིས་ཡུལ་དུ་གནོད་པ་བྱེད་པ་ལ་ཞུགས་ནས། བློན་པོ་རྣམས་ཀྱིས་བསམས་པ།
en: Upon his death the neighboring kings began to do harm to the country, and the ministers thought,

source: བདག་ཅག་ཇོ་བོ་མེད་པའི་ཕྱིར་ཉི་འོག་གི་རྒྱལ་པོ་དག་གིས་གནོད་པ་བྱེད་ཀྱིས།
en: ‘The neighboring kings do us such harm because we have no lord.

source: རྒྱལ་པོའི་སྲས་སྤྱན་དྲངས་ཏེ། རྒྱལ་སར་གཞུག་གོ་
en: We must summon the prince so that he can assume the throne.’

source: སྙམ་ནས་རྒྱལ་པོའི་བུ་དེའི་ཐད་དུ་བློན་པོ་ཆེན་པོ་སོང་སྟེ། དེས་རྒྱལ་པོའི་བུ་ལ་སྨྲས་པ།
en: With this in mind the chief minister went to see the prince and said to him,

source: ཇོ་བོ་ཁྱོད་ཀྱི་ཡབ་ནོངས་ཀྱིས་ཚུར་གཤེགས།
en: ‘Lord, your father has passed away.

source: ཡབ་ཀྱི་རྒྱལ་སྲིད་བཞེས་སུ་གསོལ།
en: Please come and assume your father’s kingdom.’

source: དེས་སྨྲས་པ་གལ་ཏེ་ཁྱོད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པར་གྱུར་ན་དེའི་འོག་ཏུ་བྱས་པ་སླེབ་བོ་ཞེས་བྱས་ནས།
en: “ ‘If you adopt the path of the ten virtuous actions, then I shall return,’ he replied.

source: དེས་བློན་པོ་ཆེན་པོ་དེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པར་བྱས་སོ། །
en: With that he led the chief minister to adopt the path of the ten virtuous actions.

source: བློན་པོ་ཆེན་པོ་དེས་ཀྱང་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: The chief minister then set all five hundred ministers on the path of the ten virtuous actions,

source: དེ་ནས་དེས་རྒྱལ་པོའི་བུ་དེ་སྤྱན་དྲངས་ཏེ། རྒྱལ་སར་བཅུག་གོ། །
en: and afterward they summoned the prince and set him on the throne.

source: དེ་ནས་དེ་དེར་འོངས་པས་ཡུལ་ཁམས་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: By returning there, he set all the country’s many inhabitants on the path of the ten virtuous actions.

source: དེའི་ཚེ་རྒྱལ་པོར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that king then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་བློན་པོ་ཆེན་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དབང་པོའི་མགོ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was that chief minister then is none other than Head of Indra.

source: དེའི་ཚེ་བློན་པོ་ལྔ་བརྒྱ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ལིཙྪ་བཱི་ལྔ་བརྒྱ་པོ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were his ministers then are none other than the five hundred Licchavis.

source: དེའི་ཚེ་ཡང་ངས་དབང་པོའི་མགོ་འདི་ཁོ་ན་ལ་བརྟེན་ནས། བློན་པོ་ལྔ་བརྒྱ་པོ་རྣམས་སྡིག་པ་ལས་བཟློག་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: At that time the five hundred ministers entrusted themselves to Head of Indra, and I turned them away from sinful actions and set them on the path of the ten virtuous actions.

source: ད་ལྟར་ཡང་ངས་ལིཙྪ་བཱི་ལྔ་བརྒྱ་པོ་འདི་རྣམས་དབང་པོའི་མགོ་འདི་ལ་བརྟེན་ནས། སྡིག་པ་ལས་བཟློག་སྟེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: Now as well they have entrusted themselves to Head of Indra, and I have turned them away from sinful actions and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་ནས།
en: “They also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན།
en: After practicing pure conduct all their lives then, their faculties ripened,

source: ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ། །
en: and now they have been liberated.”

source: ལས་བརྒྱ་ཐམ་པ་ལས་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་དགུ་པ་རྫོགས་སོ།། །།
en: This concludes Part Nine of The Hundred Deeds.

source: སྡོམ་ནི། བརྒྱ་བྱིན་རྒྱལ་པོ་རྔོན་པ་དང་། །རྨོངས་པ་དང་ནི་བྲམ་ཟེ་གསུམ། །ཁྱབ་འཇུག་དང་ནི་འཐབ་མོ་ཀླུ། །ཤི་བི་གཉིས་དང་ཀཽ་ཤཱམྦཱི། །
en: 1. Śakra 2. The King 3. The Hunter 4. The Story of Deluded 5. The Brahmin: Three Stories 6. The Story of the Householder Govinda 7. The Quarrel 8. The Nāga (2) 9.

source: བརྒྱ་བྱིན་ཞེས་བྱ་བ་ནི།
en: Two Stories about King Śibi 10. Kauśāmbī Śakra

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་ན། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་པའི་རྒྱལ་སྲིད་ཀྱི་མངའ་བདག་བྱེད་དོ། །
en: Among the gods of the Heaven of the Thirty-Three it is Śakra, King of the Gods, who reigns over the kingdom of the thirty-three gods.

source: ཆོས་ཉིད་ཀྱིས་ན་ལྷའི་བུ་འཆི་འཕོ་བའི་ཚེ། ཉེ་བའི་སྔ་ལྟས་ལྔ་འབྱུང་བར་འགྱུར་ཏེ།
en: Five signs customarily appear when gods near the time of their death and transmigration:

source: ལྷ་ནི་རང་གི་འོད་དང་ལྡན་པ་ཡིན་ན་དེའི་ཚེ་འོད་ཆུང་བར་འགྱུར་རོ། །
en: (1) Deities are illuminated from within, but at that time this light dwindles.

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་གོས་དང་། རྒྱན་རྣམས་དང་། གོས་དང་རྒྱན་གྱི་ཤིང་རྣམས་དང་། མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་རྣམས་རླུང་གིས་བསྐྱོད་ན། ཡིད་དུ་འོང་བའི་སྒྲ་འབྱུང་བ་ཡིན་ན། དེའི་ཚེ་དེ་དག་གི་སྒྲ་ཡིད་དུ་མི་འོང་བ་འབྱུང་བར་འགྱུར་རོ། །
en: (2) The clothing and ornaments of the gods of the Heaven of the Thirty-Three, as well as the branches of flowers and fruit that adorn their clothing, normally make very pleasant sounds when shaken by the wind, but at that time the sounds become unpleasant.

source: ལྷ་རྣམས་ཀྱི་གོས་རེག་ན་འཇམ་པ་ཡིན་ན། དེའི་ཚེ་དེ་དག་གི་གོས་རེག་ན་རྩུབ་པར་འགྱུར་རོ། །
en: (3) Deities’ clothing is soft to the touch, but at that time their clothing becomes very coarse.

source: ལྷ་རྣམས་ཀྱི་ལུས་ལ་དྲི་མ་མི་ཆགས་པ་ཡིན་ན། དེའི་ཚེ་དེ་དག་གི་ལུས་ལ་དྲི་མ་ཆགས་པར་འགྱུར་རོ། །
en: (4) No odor can cling to the body of a god, but at that time their bodies begin to reek.

source: ལྷ་རྣམས་ཀྱི་མིག་མི་འཛུམས་པ་ཡིན་ན། དེའི་ཚེ་དེ་དག་གི་མིག་འཛུམས་པར་འགྱུར་རོ། །
en: (5) Deities’ eyes never close, but at that time their eyes close.

source: ཉེ་བའི་ལྟས་ལྔ་ལ་མ་གཏོགས་པ་འཆི་འཕོ་བའི་ལྟས་ལྔ་འབྱུང་བར་འགྱུར་ཏེ། གོས་རྣམས་ལ་དྲི་མ་མི་ཆགས་པ་ལས་དྲི་མ་ཆགས་པར་འགྱུར་རོ། །
en: As gods approach the time of their death and transmigration, secondary signs also begin to appear: whereas before no odor could cling to their clothing, their clothing begins to reek;

source: མེ་ཏོག་ཕྲེང་བ་རྣམས་མི་རྙིང་པ་ལས་རྙིང་པར་འགྱུར་རོ། །
en: whereas before their garlands of flowers could not wilt, they begin to wilt;

source: ལུས་ལས་དྲི་ང་བ་འབྱུང་བར་འགྱུར་རོ། །
en: a foul smell comes over their bodies;

source: མཆན་ཁུང་གཉིས་ནས་རྔུལ་འབྱུང་བར་འགྱུར་རོ། །
en: perspiration starts to come from both of their armpits;

source: ལྷའི་བུ་འཆི་འཕོ་བ་ན་རང་གི་སྟན་ལ་འདུག་མི་འདོད་པར་འགྱུར་རོ། །
en: and as they near death and transmigration, they no longer wish to sit upon their thrones.

source: དེ་ནས་ཕྱི་ཞིག་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་ཉེ་བའི་ལྟས་ལྔ་པོ་རྣམས་བྱུང་སྟེ།
en: So it was that one day the secondary signs began to appear on Śakra, King of the Gods.

source: དེས་ཉེ་བའི་ལྟས་དེ་དག་བྱུང་བར་ཚོར་ནས། ཚོར་མ་ཐག་ཏུ་དེ་ཤས་ཆེར་འཇིགས་པ་སྐྱེས་ཏེ།
en: He noticed the secondary signs coming on, and upon noticing them, was immediately horrified. He thought,

source: ད་སུ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། སུ་ཞིག་གིས་བདག་གནས་འདི་ནས་ཤི་འཕོ་བར་མི་འགྱུར་བར་ནུས་ཞིག་གུ་སྙམ་མོ། །
en: “To whom can I go for refuge who could prevent me from dying and transmigrating from my current state?”

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་ཀྱིས་སྨྲས་པ།
en: The young demigoddess Śacī said,

source: ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་དུ་བཞུད་ལ། དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཁོང་དགེ་བའི་རང་བཞིན་ཅན་བཀུར་བ་རྣམས་ལ། ཐབས་ཅི་ཞིག་གིས་ན་བདག་གནས་འདི་ནས་འཕོ་བར་མི་འགྱུར་ཞེས་རྨེད་ཅིག །
en: “Kauśika, you should go to Jambudvīpa and ask those among the ascetics and brahmins who are of a virtuous nature how to prevent yourself from dying and transmigrating from your current state.

source: དེ་དག་ཉིད་ལ་སྐྱབས་སུ་བཞུད་ཅིག །
en: Seek refuge in them.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་དང་ལྷན་ཅིག་ཏུ། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ནསའཛམ་བུའི་གླིང་དུ་འོངས་ཏེ།
en: No sooner had Śakra, King of the Gods, heard this than he and the young demigoddess Śacī disappeared from the Heaven of the Thirty-Three and traveled to Jambudvīpa,

source: དེ་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་གཞན་དང་། གཞན་དག་གི་ཐད་དུ་སོང་ནས།
en: where they approached the ascetics and brahmins and others and asked,

source: ཐབས་ཅི་ཞིག་གིས་ན། ལྷའི་བུ་འཆི་འཕོ་བར་གྱུར་པ་ལས། འཆི་འཕོ་བར་མི་འགྱུར་ཞེས་དྲིས་ན།
en: “How can one prevent the death and transmigration of a god?”

source: དེ་དག་གིས་དེ་ཉིད་ལ་ཁྱོད་སུ་ཡིན་ཞེས་ཕྱིར་དྲིས་སོ། །
en: “Who are you?” they asked in reply.

source: དེས་སྨྲས་པ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡིན་ནོ། །
en: “I am Śakra, King of the Gods,” he said.

source: དེ་ནས་དེ་དག་གཞི་དེ་ལས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ།
en: Overcome with joy and elation they said,

source: བདག་ཅག་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བལྟར་འོངས་པ་འདི་ནི་བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ་ཞེས་ཟེར་ནས།
en: “What a great boon for us! Śakra, King of the Gods, has come to see us!”

source: དེ་དག་དེ་ལ་སྐྱབས་སུ་འགྲོ་བར་བྱེད་དོ། །
en: And they went to him for refuge.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: In despair, Śakra, King of the Gods thought,

source: འདི་ལྟར་བདག་ནི་འདི་རྣམས་ལ་འདྲི་བར་འདོད་ཅིང་། སྐྱབས་སུ་འགྲོ་བར་འདོད་པ་ལས། འདི་དག་བདག་ལ་སྐྱབས་སུ་འགྲོ་བར་བྱེད་ན།
en: “I came here seeking refuge, wishing to ask them a question, and instead they took refuge in me.

source: བདག་དགེ་སྦྱོང་དང་བྲམ་ཟེ་འདི་དག་ལྟ་བུ་ལ་དྲི་ཅི་དགོས་སྙམ་ནས་རེ་ཐག་ཆད་དེ།
en: What need is there to put my question to these ascetics and brahmins now?”

source: དེ་དག་ལ་རེ་བ་མེད་པར་གྱུར་ཏོ། །
en: and he abandoned the hope he had in them.

source: དེ་ནས་དེའི་སྐབས་སུ་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པས། གཟིགས་པ་རྣམ་པ་བཞིས་འཇིག་རྟེན་ལ་གཟིགས་ནས་
en: Now on that occasion the Bodhisattva was in the Tuṣita Heaven observing the world by means of the four observations,

source: འདོད་པ་ལ་སྤྱོད་པའི་རིགས་དྲུག་ཏུ་ཚིག་ཏུ་བརྗོད་ཅིང་ཀུན་ཏུ་སྒྲ་བསྒྲགས་ཏེ།
en: and he addressed all six classes of beings in the desire realms, saying,

source: གྲོགས་པོ་དག་ང་ནི་འཛམ་བུའི་གླིང་དུ་ཉིང་མཚམས་སྦྱོར་བ་ལེན་ཅིང་། འགྲོ་བ་རྣམས་ཀྱང་བདུད་རྩིས་ཚིམ་པར་བྱེད་ཀྱིས།
en: “Friends, this evening I shall take birth in Jambudvīpa, where I shall satiate living beings with the nectar of immortality.

source: ཁྱོད་ལས་སུ་བདུད་རྩི་འདོད་པ་དེ་དག་འཛམ་བུའི་གླིང་དུ་ཉིང་མཚམས་སྦྱོར་བ་ལོང་ཤིག་དང་།
en: Let those among you who wish for this nectar also take birth in Jambudvīpa.

source: དེར་ངས་ཁྱོད་ལ་བདུད་རྩིའི་བགོ་བཤའ་བྱའོ་ཞེས་བྱས་ནས
en: There I shall grant a share of nectar to you.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཡུམ་གྱི་ལྷུམས་སུ་ཉིང་མཚམས་སྦྱོར་བ་བླངས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: Then the Bodhisattva reincarnated in his mother’s womb, and Śakra, King of the Gods, thought,

source: བདག་ཅག་གིས་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ལ་བསྙེན་བཀུར་བྱ་ཅི་དགོས།
en: “What need is there for me to offer the ascetics and brahmins my help and respect?

source: བྱང་ཆུབ་སེམས་དཔའ་འདི་ཡུམ་གྱི་ལྷུམས་སུ་ཉིང་མཚམས་སྦྱོར་བ་བླངས་པས་ན།
en: This bodhisattva has reincarnated in his mother’s womb.

source: དེ་གང་གི་ཚེ་བལྟམས་པ་དེའི་ཚེ། བདུད་རྩི་རྟོགས་པར་འགྱུར་བས། དེའི་འོག་ཏུ་བདག་གིས་བསྙེན་བཀུར་བྱའོ་སྙམ་ནས།
en: After he is born he will realize the nectar of immortality—let me then offer him my help and respect.”

source: དེའི་ཚེ་ལྷའི་བུ་བཞི་དེའི་སྲུངས་མར་བཏང་ངོ་། །
en: He sent four gods to be the Bodhisattva’s protectors.

source: བདག་ཉིད་ཀྱང་དུས་དུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་ཐད་དུ་སྲུང་བའི་ཕྱིར་འགྲོ་བར་བྱེད་དོ། །
en: From time to time he himself went to protect the Bodhisattva,

source: བལྟམས་པའི་མོད་ལ་ཡང་བདག་ཉིད་ཀྱིས་བླངས་སོ། །
en: and when the Bodhisattva was born it was Śakra himself who gathered him up in his arms.

source: སྐུ་ཆེར་སྐྱེས་པའི་ཚེ་ཡང་དེས་སྐྱོ་བ་བསྐྱེད་དོ། །
en: When the Bodhisattva grew up, became disillusioned with saṃsāra,

source: ངེས་པར་འབྱུང་བར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱས་སོ། །
en: and began making efforts in renunciation.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཡང་བསྲུང་བའི་ཕྱིར་སོང་ངོ་། །
en: Śakra also traveled to the Bodhimaṇḍa to protect him.

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས། ལྔ་སྡེ་དང་ཉེ་བའི་ལྔ་སྡེ་དང་། གྲོང་གི་བྱིས་པ་སྟོད་རིམ་ལྔ་བཅུ་དང་། བཟང་སྡེའི་སྡེ་ཚན་རྣམས་བཏུལ་བ་དང་། དགའ་མོ་དང་དགའ་སྟོབས་མ་བདེན་པ་རྣམས་ལ་བཀོད་པ་དང་།
en: When the Bodhisattva had achieved unexcelled wisdom, tamed a first and then a second group of five, tamed fifty upper-class village boys and the group known as the Good, established Nandā and Nandabalā in the truths,

source: ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཆུ་ཀླུང་འོད་སྲུང་སྤུན་རབ་ཏུ་བྱུང་བ་དང་།
en: caused Uruvilvā Kāśyapa and Nadī Kāśyapa to go forth,

source: ག་ཡཱར་གཤེགས་ནས་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་བསྟན་པ་དང་།
en: displayed three miracles upon traveling to Gayā,

source: འོད་མའི་ཚལ་ནགས་ཁྲོད་དུ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་དང་ལྷ་བརྒྱད་ཁྲི་དང་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་བདེན་པ་རྣམས་ལ་བཀོད་པ་དེའི་ཚེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: and in Bamboo Grove placed in the truths King Bimbisāra and eighty thousand gods, as well as the brahmins of Magadha and thousands upon thousands of householders, Śakra, King of the Gods, thought,

source: ད་དུང་འདི་ནི་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ལུང་བསྟན་པ་ཞུ་བའི་དུས་མ་ཡིན་ནོ་སྙམ་མོ། །
en: “This is still not a good time for me to ask the Blessed One my question.”

source: དེ་ནས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་བདེན་པ་རྣམས་ལ་གནས་པར་བྱས་ནས། རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་ཏེ། འོད་མའི་ཚལ་གཞེས་ནས། དགེ་སློང་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཉིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྟན་པ་རྒྱས་པར་མཛད་ནས་
en: After the Blessed One had placed King Bimbisāra in the truths, traveled to Rājagṛha, and accepted Bamboo Grove, he caused Śāriputra and Maudgalyāyana to go forth, spreading the doctrine.

source: དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་པ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ཕོངས་པ་དང་། ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན།
en: Who is destitute, in a dreadful state, and being harmed?

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་སྨིན་ཟིན་པ་ལས་ཡེ་ཤེས་ཀྱི་མཚོན་གྱིས་བརྟོལ་བར་བྱ།
en: Whom, having already ripened their roots of virtue, shall I slice open with the blade of wisdom?
